// task 2
// მოდულარობა ნიშნავს პროგრამის დაყოფას უფრო პატარა, დამოუკიდებელ და მრავალჯერ გამოყენებად ნაწილებად.
//ამ თითოეული ნაწილის გამოყენება ცალ-ცალკე არის შესაძლებელი.

//task 3
// key ატრიბუტი გამოიყენება, რომ თითოეული ელემენტი გახდეს განსაკუთრებული და საიტის შეცვლის დროს პროგრამა მარტივად მიხვდება
//რომელი ელემენტი უნდა შეიცვალოს და რომელი არა, ისე რომ თანმიმდრევრობა და სტრუქტურა საიტზე არსებული კონპონენტების არ შეიცვლება.

//task 5
const listn = [1, 2, 3, 4, 5, 6];
const listm = ["Hello world!", "Bye", "JS", "Python"];
//map example
console.log(listn.map((i) => i **2));
console.log(listm.map((i) => i.toLowerCase()));

//filter example
console.log(listn.filter((i) => i % 2 == 0));
console.log(listm.filter((i) => i.length > 3));


